<?php

namespace App;

use App\Traits\DeleteTrait;
use Illuminate\Database\Eloquent\Model;

class advert extends Model
{
    use DeleteTrait;

    protected $guarded = [];

    static public $prefix = 'adverts';
    static public $sysobjid = 907;

    public function whocrt()
    {
        return $this->hasOne(User::class, 'id', 'created_by');
    }

    public function whoupd()
    {
        return $this->hasOne(User::class, 'id', 'updated_by');
    }

    static public function lstActive()
    {
        return null;
        return collect([
            ['whndt' => today()->format('d.m.Y'),
                'subj' => 'Подписан договор генерального подряда по строительству 1-й очереди МКЖД на сопке "Холодильник"!',
                'anons' => 'В результате проделанной работы, между ООО «СК Баско» и ООО «СТРОЙ ПРОЕКТ» подписан  договор Генерального подряда   № СКБ/2021-4 на выполнение комплекса работ по строительству Объекта и вводу его в эксплуатацию:  Комплекс многоквартирных жилых домов в районе ул. Снеговая, 9 в г. Владивостоке 1-ая очередь общей площадью 37 071 кв. м. Жилые дома № 8 и № 9 жилой площадью 19 620 кв. м., со встроенной подземной автостоянкой № 4 площадью 8859 кв. м., на земельном участке с кадастровым номером 25:28040012:2518 по адресу: Приморский край, г. Владивосток, ул. Снеговая, в районе дома 9, на основании Ведомости объемов работ, сводного сметного расчета, в соответствии с проектной документацией. Место исполнения договора – г. Владивосток, ул., Снеговая, в районе дома 9.
<br><br><b><i>Выбор ООО «СК Баско» в качестве генерального подрядчика свидетельствует о растущем авторитете компании среди строительных организаций Приморского края.</b></i>

<br><br><b>Браунагель Е.Г.</b>:
<div class="ml-5"><i>
«Дорогие коллеги, друзья!
<br>Хочу  искренне поздравить весь наш коллектив, КАЖДОГО специалиста с этим высоким достижением. Только благодаря совместному и высокопрофессиональному труду всей компании стало возможным выйти на подписание этого договора.
<br>
<br>Так держать,
<br>Спасибо всем!»</i>
<br>
<br></div>

'],
        ]);
    }
}
